project/src/Catalogs/Конвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Конвертации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертацией</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертациейОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойУдаления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтложеннымЗаполнением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтправкойИнформацииОбУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередПолучениемИзмененныхОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиПравилОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеПолученияИнформацииОбУзлахОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриПолученииИнформацииОбУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия82</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоОбъектамВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПереводИменОбъектовФормата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДляСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРазделениеМодуля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТипизациюПеременных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонфигурацияКорреспондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайловойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыгрузкиРазделенногоМодуля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыгрузкиРазделенногоМодуля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииФормата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерсияФормата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииФормата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстанавливатьВДиалоге</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуетсяПриЗагрузке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьПараметрПриВыгрузке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоКонвертации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВременнаяКопия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/CommonForms/ВыборКонфигурацийИсточникаПриемника/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
	Элементы.ОтборПоРодителю.Доступность = ИспользоватьОтборПоРодителю;
	Элементы.ОтборПоСтатусу.Доступность = ИспользоватьОтборПоСтатусу;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонвертацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	Если Элементы.Конвертации.ТекущиеДанные.ЭтоГруппа = Истина Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("парКонвертация", Элементы.Конвертации.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Обработка.НастройкаПравилОбмена.Форма", ПараметрыФормы,, Элементы.Конвертации.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяКонфигурацияИсточникПриИзменении(Элемент)
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяКонфигурацияПриемникПриИзменении(Элемент)
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПомеченныеНаУдалениеПриИзменении(Элемент)
	ОбновитьСписокКонвертаций();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ИзменитьПометкуНаУдалениеКонвертации(Команда)
	ТекКонвертация = Элементы.Конвертации.ТекущиеДанные.Ссылка;
	ТекПометкаУдаления = Элементы.Конвертации.ТекущиеДанные.ПометкаУдаления;
	ТекстВопроса = НСтр("ru='Выполнить %1% для %2%?'");
	Если ТекПометкаУдаления Тогда
		НовПометкаУдаления = Ложь;
		ТекстВопроса = НСтр("ru='Снять с %1% пометку удаления?'");
	Иначе
		НовПометкаУдаления = Истина;
		ТекстВопроса = НСтр("ru='Пометить %1% на удаление?'");
	КонецЕсли;
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%1%", СокрЛП(ТекКонвертация));
	ОповещениеОтвет = Новый ОписаниеОповещения("ВыборИзменитьПометкуНаУдалениеКонвертации", ЭтотОбъект, Новый Структура("НовПометкаУдаления, Ссылка", НовПометкаУдаления, ТекКонвертация));
	ПоказатьВопрос(ОповещениеОтвет, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СохранитьЗначенияНастроек()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ТекущаяКонфигурацияИсточник", ТекущаяКонфигурацияИсточник);
	СтруктураНастроек.Вставить("ТекущаяКонфигурацияПриемник", ТекущаяКонфигурацияПриемник);
	СтруктураНастроек.Вставить("ОтборПоСтатусу", ОтборПоСтатусу);
	СтруктураНастроек.Вставить("ИспользоватьОтборПоСтатусу", ИспользоватьОтборПоСтатусу);


	КонвертацияДанныхXDTOВызовСервера.ЗаписатьНастройкиПользователя(СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначенияНастроек()
	
	СтруктураНастроек = КонвертацияДанныхXDTOВызовСервера.НастройкиПользователя();
	ТекущаяКонфигурацияИсточник = СтруктураНастроек.ТекущаяКонфигурацияИсточник;
	ТекущаяКонфигурацияПриемник = СтруктураНастроек.ТекущаяКонфигурацияПриемник;
	ИспользоватьОтборПоСтатусу = СтруктураНастроек.ИспользоватьОтборПоСтатусу;
	ОтборПоСтатусу = СтруктураНастроек.ОтборПоСтатусу;
	Элементы.ГруппаОтборПоСтатусу.Видимость = Истина;
	Если Константы.СовместнаяРабота.Получить() = Ложь Тогда
		ИспользоватьОтборПоСтатусу = Ложь;
		Элементы.ГруппаОтборПоСтатусу.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКонвертаций()
	Конвертации.ПолучитьЭлементы().Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Конвертации.Родитель,
	|	Конвертации.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
	|	Конвертации.Ссылка,
	|	Конвертации.Наименование КАК Наименование,
	|	Конвертации.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР 
	|		КОГДА Конвертации.ПометкаУдаления И Конвертации.ЭтоГруппа ТОГДА 1
	|		КОГДА НЕ Конвертации.ПометкаУдаления И Конвертации.ЭтоГруппа ТОГДА 0
	|		КОГДА НЕ Конвертации.ПометкаУдаления И НЕ Конвертации.ЭтоГруппа ТОГДА 3 
	|		КОГДА Конвертации.ПометкаУдаления И НЕ Конвертации.ЭтоГруппа ТОГДА 4
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	Справочник.Конвертации КАК Конвертации
	|ГДЕ 
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ ПО Конвертации.Ссылка ИЕРАРХИЯ
	|";
	ТекстУсловия = "";
	Если ЗначениеЗаполнено(ТекущаяКонфигурацияИсточник) ИЛИ ЗначениеЗаполнено(ТекущаяКонфигурацияПриемник) Тогда
		ТекстУсловия = "(
			|(Конфигурация В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XDTO))
			| ИЛИ (Конфигурация В (&МассивКонфигураций) И КонфигурацияКорреспондент В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XML))
			|)";
		МассивКонфигураций = Новый Массив;
		Если ЗначениеЗаполнено(ТекущаяКонфигурацияИсточник) Тогда
			МассивКонфигураций.Добавить(ТекущаяКонфигурацияИсточник);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущаяКонфигурацияПриемник) Тогда
			МассивКонфигураций.Добавить(ТекущаяКонфигурацияПриемник);
		КонецЕсли;
		Если МассивКонфигураций.Количество() = 1 Тогда
			ТекстУсловия = "(
			|(Конфигурация В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XDTO))
			| ИЛИ ((Конфигурация В (&МассивКонфигураций) ИЛИ КонфигурацияКорреспондент В (&МассивКонфигураций)) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XML))
			|)";
		Иначе
			ТекстУсловия = "(
			|(Конфигурация В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XDTO))
			| ИЛИ (Конфигурация В (&МассивКонфигураций) И КонфигурацияКорреспондент В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XML))
			|)";
		КонецЕсли;
		Запрос.УстановитьПараметр("МассивКонфигураций", МассивКонфигураций);
	КонецЕсли;
	Если ИспользоватьОтборПоСтатусу Тогда
		Если ТекстУсловия <> "" Тогда
			ТекстУсловия = ТекстУсловия + " И ";
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + "Статус = &Статус";
		Запрос.УстановитьПараметр("Статус", ОтборПоСтатусу);
	КонецЕсли;
	Если ИспользоватьОтборПоРодителю Тогда
		Если ТекстУсловия <> "" Тогда
			ТекстУсловия = ТекстУсловия + " И ";
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + "Ссылка В ИЕРАРХИИ (&Родитель)";
		Запрос.УстановитьПараметр("Родитель", ОтборПоРодителю);
	КонецЕсли;
	Если НЕ ПоказыватьПомеченныеНаУдаление Тогда
		Если ТекстУсловия <> "" Тогда
			ТекстУсловия = ТекстУсловия + " И ";
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + "ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	
	Если ТекстУсловия = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "ГДЕ " + ТекстУсловия);
	КонецЕсли;
	

	ДеревоРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ОбработатьСтрокиДерева(ДеревоРезультат.Строки, Конвертации.ПолучитьЭлементы());
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокиДерева(СтрокиИсходные, СтрокиКДобавлению)
	Для Каждого СтрокаДерева Из СтрокиИсходные Цикл
		Если СтрокаДерева.Родитель <> Неопределено И СтрокаДерева.Родитель.Ссылка = СтрокаДерева.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		СтрокаКДобавлению = СтрокиКДобавлению.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКДобавлению, СтрокаДерева);
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ОбработатьСтрокиДерева(СтрокаДерева.Строки, СтрокаКДобавлению.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСтатусуПриИзменении(Элемент)
	Элементы.ОтборПоСтатусу.Доступность = ИспользоватьОтборПоСтатусу;
	Если НЕ ИспользоватьОтборПоСтатусу Тогда
		ОтборПоСтатусу = Неопределено;
	КонецЕсли;
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоРодителюПриИзменении(Элемент)
	Элементы.ОтборПоРодителю.Доступность = ИспользоватьОтборПоРодителю;
	Если НЕ ИспользоватьОтборПоРодителю Тогда
		ОтборПоРодителю = Неопределено;
	КонецЕсли;
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоРодителюПриИзменении(Элемент) 	
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзменитьПометкуНаУдалениеКонвертации(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПометкуУдаления(ДополнительныеПараметры);
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаСервере
Процедура ИзменитьПометкуУдаления(ПараметрыВыполнения)
	КонвОбъект = ПараметрыВыполнения.Ссылка.ПолучитьОбъект();
	Попытка
		КонвОбъект.УстановитьПометкуУдаления(ПараметрыВыполнения.НовПометкаУдаления);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось выполнить операцию: '") + ОписаниеОшибки());
	КонецПопытки
КонецПроцедуры
#КонецОбласти
